In [1]:

import pandas as pd
import numpy as np

apple_df = pd.DataFrame({"AAPL": [72.27, np.nan, 74.39, np.nan, 75.94, 76.93,np.nan, 78.74, np.nan, 79.81, np.nan, 79.53, np.nan, 79.56, 79.49]})

apple_df

     AAPL
0   72.27
1     NaN
2   74.39
3     NaN
4   75.94
5   76.93
6     NaN
7   78.74
8     NaN
9   79.81
10    NaN
11  79.53
12    NaN
13  79.56
14  79.49

In [2]:
apple_df.isnull()

     AAPL
0   False
1    True
2   False
3    True
4   False
5   False
6    True
7   False
8    True
9   False
10   True
11  False
12   True
13  False
14  False

In [3]:
apple_df.isnull().sum()

AAPL    6
dtype: int64

In [14]:
apple_df.isnull().mean()

AAPL    0.4
dtype: float64

In [15]:
apple_df = apple_df.fillna(apple_df.mean())
apple_df

         AAPL
0   72.270000
1   77.406667
2   74.390000
3   77.406667
4   75.940000
5   76.930000
6   77.406667
7   78.740000
8   77.406667
9   79.810000
10  77.406667
11  79.530000
12  77.406667
13  79.560000
14  79.490000

In [16]:
import pandas as pd
best_actors_df = pd.DataFrame({
    "Best Actors": ["Nic Cage", "Nic Cage", "Harrison Ford"]
})
best_actors_df

     Best Actors
0       Nic Cage
1       Nic Cage
2  Harrison Ford

In [17]:
best_actors_df.duplicated()

0    False
1     True
2    False
dtype: bool

In [18]:
best_actors_df = best_actors_df.drop_duplicates()

In [19]:
best_actors_df

     Best Actors
0       Nic Cage
2  Harrison Ford

In [20]:
import pandas as pd

prices = pd.DataFrame({
    "price_usd": ["$0.53", "$0.22", "0.34"]
})

prices

  price_usd
0     $0.53
1     $0.22
2      0.34

In [21]:
prices.dtypes

price_usd    object
dtype: object

In [32]:
prices.loc[:, "price_usd"] = prices.loc[:, "price_usd"].astype("str")
prices.dtypes

price_usd    object
dtype: object

In [33]:
prices.loc[:, "price_usd"] = prices.loc[:, "price_usd"].str.replace("$", "")
prices
prices.dtypes

C:\Users\jsrit\AppData\Local\Temp\ipykernel_18112\2773098020.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  prices.loc[:, "price_usd"] = prices.loc[:, "price_usd"].str.replace("$", "")

price_usd    object
dtype: object